PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_adc.h
/* ADC inserted channel definitions */
#define ADC_INSERTED_CHANNEL_0           ((uint8_t)0x00U)                            /*!< ADC inserted channel 0 */
#define ADC_INSERTED_CHANNEL_1           ((uint8_t)0x01U)                            /*!< ADC inserted channel 1 */
#define ADC_INSERTED_CHANNEL_2           ((uint8_t)0x02U)                            /*!< ADC inserted channel 2 */
#define ADC_INSERTED_CHANNEL_3           ((uint8_t)0x03U)                            /*!< ADC inserted channel 3 */

/* ADC interrupt definitions */
#define ADC_INT_WDE                      ADC_STAT_WDE                                /*!< analog watchdog event interrupt */
#define ADC_INT_EOC                      ADC_STAT_EOC                                /*!< end of sequence conversion interrupt */
#define ADC_INT_EOIC                     ADC_STAT_EOIC                               /*!< end of inserted sequence conversion interrupt */

/* ADC interrupt flag */
#define ADC_INT_FLAG_WDE                 ADC_STAT_WDE                                /*!< analog watchdog event interrupt flag */
#define ADC_INT_FLAG_EOC                 ADC_STAT_EOC                                /*!< end of sequence conversion interrupt flag */
#define ADC_INT_FLAG_EOIC                ADC_STAT_EOIC                               /*!< end of inserted sequence conversion interrupt flag */

/* the callback of ADC interrupt declaration */
typedef void (*hal_adc_dma_handle_cb)(void *ptr);

/* ADC structure type enum */
typedef enum {
    HAL_ADC_INIT_STRUCT,                                                             /*!< ADC initialization structure */
    HAL_ADC_ROUTINE_RANK_CONFIG_STRUCT,                                              /*!< ADC routine rank configuration structure */
    HAL_ADC_ROUTINE_CONFIG_STRUCT,                                                   /*!< ADC routine channel configuration structure */
    HAL_ADC_INSERTED_RANK_CONFIG_STRUCT,                                             /*!< ADC inserted rank configuration structure */
    HAL_ADC_INSERTED_CONFIG_STRUCT,                                                  /*!< ADC inserted channel configuration structure */
    HAL_ADC_IRQ_STRUCT,                                                              /*!< ADC device interrupt callback function pointer structure */
    HAL_ADC_DMA_HANDLE_CB_STRUCT,                                                    /*!< ADC DMA callback function pointer structure */
    HAL_ADC_WATCHDOG_CONFIG_STRUCT,                                                  /*!< ADC watchdog configuration structure */
    HAL_ADC_DEV_STRUCT                                                               /*!< ADC device information structrue */
} hal_adc_struct_type_enum;

/* ADC state type enum */
typedef enum {
    HAL_ADC_STATE_RESET         = (uint32_t)0x00000000U,                             /*!< ADC is not initialized or disabled */
    HAL_ADC_STATE_READY         = (uint32_t)0x00000001U,                             /*!< ADC is ready */
    HAL_ADC_STATE_BUSY_SYSTEM   = (uint32_t)0x00000002U,                             /*!< ADC is busy to internal system (initialization, calibration) */
    HAL_ADC_STATE_TIMEOUT       = (uint32_t)0x00000004U,                             /*!< ADC timeout occurs */
    HAL_ADC_STATE_ROUTINE_BUSY  = (uint32_t)0x00000010U,                             /*!< a conversion is ongoing on routine sequence */
    HAL_ADC_STATE_ROUTINE_EOC   = (uint32_t)0x00000020U,                             /*!< conversion data available on routine sequence */
    HAL_ADC_STATE_INSERTED_BUSY = (uint32_t)0x00000100U,                             /*!< a conversion is ongoing on inserted sequence */
    HAL_ADC_STATE_INSERTED_EOC  = (uint32_t)0x00000200U,                             /*!< conversion data available on inserted sequence */
    HAL_ADC_STATE_WATCHDOG      = (uint32_t)0x00001000U,                             /*!< analog watchdog */
} hal_adc_state_enum;

/* ADC error type enum */
typedef enum {
    HAL_ADC_ERROR_NONE   = (uint32_t)0x00U,                                          /*!< no error */
    HAL_ADC_ERROR_SYSTEM = (uint32_t)0x01U,                                          /*!< ADC internal error: if problem of clocking, enable/disable, wrong state */
    HAL_ADC_ERROR_DMA    = (uint32_t)0x02U,                                          /*!< DMA transfer error */
    HAL_ADC_ERROR_CONFIG = (uint32_t)0x04U,                                          /*!< configuration error occurs */
} hal_adc_error_enum;

/* ADC device interrupt callback function pointer structure */
typedef struct {
    hal_irq_handle_cb                adc_eoc_handle;                                 /*!< EOC interrupt handler function */
    hal_irq_handle_cb                adc_eoic_handle;                                /*!< EOIC interrupt handler function */
    hal_irq_handle_cb                adc_watchdog_handle;                            /*!< watchdog event interrupt handler function */
} hal_adc_irq_struct;

/* ADC DMA callback function pointer structure */
typedef struct {
    __IO hal_adc_dma_handle_cb       full_transcom_handle;                           /*!< DAC DMA transfer complete interrupt handler function */
    __IO hal_adc_dma_handle_cb       half_transcom_handle;                           /*!< DAC DMA transfer complete interrupt handler function */
    __IO hal_adc_dma_handle_cb       error_handle;                                   /*!< DAC DMA error underflow handler function */
} hal_adc_dma_handle_cb_struct;

/* ADC device information structrue */
typedef struct {
    hal_adc_irq_struct               adc_irq;                                        /*!< ADC device interrupt callback function pointer structure */
    hal_dma_dev_struct               *p_dma_adc;                                     /*!< DMA device information structrue */
    hal_adc_dma_handle_cb_struct     adc_dma;                                        /*!< DMA callback function pointer structure */
    hal_adc_error_enum               error_state;                                    /*!< ADC error state */
    hal_mutex_enum                   mutex;                                          /*!< ADC mutex set */
    hal_adc_state_enum               state;                                          /*!< ADC state */
} hal_adc_dev_struct;

/* @STRUCT_MEMBER: oversampling_shift */
/* @ENUM:  oversampling shift */
typedef enum {
    ADC_OVERSAMPLE_SHIFT_NONE = (uint16_t)(ADC_OVERSAMPLING_SHIFT_NONE),             /*!< no oversampling shift */
    ADC_OVERSAMPLE_SHIFT_1B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_1B),               /*!< 1-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_2B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_2B),               /*!< 2-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_3B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_3B),               /*!< 3-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_4B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_4B),               /*!< 4-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_5B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_5B),               /*!< 5-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_6B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_6B),               /*!< 6-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_7B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_7B),               /*!< 7-bit oversampling shift */
    ADC_OVERSAMPLE_SHIFT_8B   = (uint16_t)(ADC_OVERSAMPLING_SHIFT_8B),               /*!< 8-bit oversampling shift */
} hal_adc_oversample_shift_enum;

/* @STRUCT_MEMBER: oversampling_ratio */
/* @ENUM:  oversampling ratio */
typedef enum {
    ADC_OVERSAMPLE_RATIO_MUL2   = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL2),            /*!< oversampling ratio multiple 2 */
    ADC_OVERSAMPLE_RATIO_MUL4   = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL4),            /*!< oversampling ratio multiple 4 */
    ADC_OVERSAMPLE_RATIO_MUL8   = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL8),            /*!< oversampling ratio multiple 8 */
    ADC_OVERSAMPLE_RATIO_MUL16  = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL16),           /*!< oversampling ratio multiple 16 */
    ADC_OVERSAMPLE_RATIO_MUL32  = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL32),           /*!< oversampling ratio multiple 32 */
    ADC_OVERSAMPLE_RATIO_MUL64  = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL64),           /*!< oversampling ratio multiple 64 */
    ADC_OVERSAMPLE_RATIO_MUL128 = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL128),          /*!< oversampling ratio multiple 128 */
    ADC_OVERSAMPLE_RATIO_MUL256 = (uint8_t)(ADC_OVERSAMPLING_RATIO_MUL256),          /*!< oversampling ratio multiple 256 */
} hal_adc_oversample_ratio_enum;

/* @STRUCT_MEMBER: routine_sequence */
/* @ENUM:  routine rank sequence */
typedef enum {
    ADC_ROUTINE_SEQUENCE_0  = (uint8_t)0x00U,                                        /*!< ADC routine channel sequence 0 */
    ADC_ROUTINE_SEQUENCE_1  = (uint8_t)0x01U,                                        /*!< ADC routine channel sequence 1 */
    ADC_ROUTINE_SEQUENCE_2  = (uint8_t)0x02U,                                        /*!< ADC routine channel sequence 2 */
    ADC_ROUTINE_SEQUENCE_3  = (uint8_t)0x03U,                                        /*!< ADC routine channel sequence 3 */
    ADC_ROUTINE_SEQUENCE_4  = (uint8_t)0x04U,                                        /*!< ADC routine channel sequence 4 */
    ADC_ROUTINE_SEQUENCE_5  = (uint8_t)0x05U,                                        /*!< ADC routine channel sequence 5 */
    ADC_ROUTINE_SEQUENCE_6  = (uint8_t)0x06U,                                        /*!< ADC routine channel sequence 6 */
    ADC_ROUTINE_SEQUENCE_7  = (uint8_t)0x07U,                                        /*!< ADC routine channel sequence 7 */
    ADC_ROUTINE_SEQUENCE_8  = (uint8_t)0x08U,                                        /*!< ADC routine channel sequence 8 */
    ADC_ROUTINE_SEQUENCE_9  = (uint8_t)0x09U,                                        /*!< ADC routine channel sequence 9 */
    ADC_ROUTINE_SEQUENCE_10 = (uint8_t)0x0AU,                                        /*!< ADC routine channel sequence 10 */
    ADC_ROUTINE_SEQUENCE_11 = (uint8_t)0x0BU,                                        /*!< ADC routine channel sequence 11 */
    ADC_ROUTINE_SEQUENCE_12 = (uint8_t)0x0CU,                                        /*!< ADC routine channel sequence 12 */
    ADC_ROUTINE_SEQUENCE_13 = (uint8_t)0x0DU,                                        /*!< ADC routine channel sequence 13 */
    ADC_ROUTINE_SEQUENCE_14 = (uint8_t)0x0EU,                                        /*!< ADC routine channel sequence 14 */
    ADC_ROUTINE_SEQUENCE_15 = (uint8_t)0x0FU,                                        /*!< ADC routine channel sequence 15 */
} hal_adc_routine_sequence_enum;

/* @STRUCT_MEMBER: inserted_sequence */
/* @ENUM:  inserted rank sequence */
typedef enum {
    ADC_INSERTED_SEQUENCE_0 = (uint8_t)0x00U,                                        /*!< ADC inserted channel sequence 0 */
    ADC_INSERTED_SEQUENCE_1 = (uint8_t)0x01U,                                        /*!< ADC inserted channel sequence 1 */
    ADC_INSERTED_SEQUENCE_2 = (uint8_t)0x02U,                                        /*!< ADC inserted channel sequence 2 */
    ADC_INSERTED_SEQUENCE_3 = (uint8_t)0x03U,                                        /*!< ADC inserted channel sequence 3 */
} hal_adc_inserted_sequence_enum;

/* ADC Common Settings */
/* @PARA: adc */
/* @STRUCT: ADC common settings config struct */
typedef struct {
    uint32_t                         data_alignment;                                 /*!< ADC data alignment */
    uint32_t                         resolution;                                     /*!< ADC data resolution select */
    ControlStatus                    scan_mode;                                      /*!< scan mode */
    ControlStatus                    hardware_oversampling;                          /*!< oversampling enable */
    uint32_t                         oversample_trigger_mode;                        /*!< triggered oversampling */
    hal_adc_oversample_shift_enum    oversampling_shift;                             /*!< oversampling shift */
    hal_adc_oversample_ratio_enum    oversampling_ratio;                             /*!< oversampling ratio */
} hal_adc_init_struct;

