PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_adc.h
/* @STRUCT_MEMBER: data_alignment */
/* @DEFINE: data alignment */
#define ADC_LSB_ALIGNMENT           ((uint32_t)0x00000000U)                          /*!< LSB alignment */
#define ADC_MSB_ALIGNMENT           ADC_CTL1_DAL                                     /*!< MSB alignment */

/* @STRUCT_MEMBER: resolution */
/* @DEFINE: adc resolution */
#define ADC_RESOLUTION_12B          CTL0_DRES(0)                                     /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B          CTL0_DRES(1)                                     /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B           CTL0_DRES(2)                                     /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B           CTL0_DRES(3)                                     /*!< 6-bit ADC resolution */

/* @STRUCT_MEMBER: scan_mode */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: hardware_oversampling */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: oversample_trigger_mode */
/* @DEFINE: triggered oversampling */
#define ADC_OVERSAMPLING_ALL_CONVERT     0U                                          /*!< all oversampled conversions for a channel are done consecutively after a trigger */
#define ADC_OVERSAMPLING_ONE_CONVERT     1U                                          /*!< each oversampled conversion for a channel needs a trigger */

/* @FUNCTION: initialize ADC */
int32_t hal_adc_init(hal_adc_dev_struct *adc_dev, hal_adc_init_struct *adc);

/* Routine sequence Settings */
/* @PARA: p_rrank */
/* @STRUCT: routine rank settings config struct */
typedef struct {
    uint32_t                         channel;                                        /*!< ADC channel select */
    uint32_t                         sampling_time;                                  /*!< ADC sample time */
    hal_adc_routine_sequence_enum    routine_sequence;                               /*!< ADC routine channel sequence */
} hal_adc_routine_rank_config_struct;

/* @STRUCT_MEMBER: channel */
/* @DEFINE: ADC channel select */
#define ADC_CHANNEL_0                    ((uint8_t)0x00U)                            /*!< ADC channel 0 */
#define ADC_CHANNEL_1                    ((uint8_t)0x01U)                            /*!< ADC channel 1 */
#define ADC_CHANNEL_2                    ((uint8_t)0x02U)                            /*!< ADC channel 2 */
#define ADC_CHANNEL_3                    ((uint8_t)0x03U)                            /*!< ADC channel 3 */
#define ADC_CHANNEL_4                    ((uint8_t)0x04U)                            /*!< ADC channel 4 */
#define ADC_CHANNEL_5                    ((uint8_t)0x05U)                            /*!< ADC channel 5 */
#define ADC_CHANNEL_6                    ((uint8_t)0x06U)                            /*!< ADC channel 6 */
#define ADC_CHANNEL_7                    ((uint8_t)0x07U)                            /*!< ADC channel 7 */
#define ADC_CHANNEL_8                    ((uint8_t)0x08U)                            /*!< ADC channel 8 */
#define ADC_CHANNEL_9                    ((uint8_t)0x09U)                            /*!< ADC channel 9 */
#define ADC_CHANNEL_10                   ((uint8_t)0x0AU)                            /*!< ADC channel 10 */
#define ADC_CHANNEL_11                   ((uint8_t)0x0BU)                            /*!< ADC channel 11 */
#define ADC_CHANNEL_12                   ((uint8_t)0x0CU)                            /*!< ADC channel 12 */
#define ADC_CHANNEL_13                   ((uint8_t)0x0DU)                            /*!< ADC channel 13 */
#define ADC_CHANNEL_14                   ((uint8_t)0x0EU)                            /*!< ADC channel 14 */
#define ADC_CHANNEL_15                   ((uint8_t)0x0FU)                            /*!< ADC channel 15 */
#define ADC_CHANNEL_16                   ((uint8_t)0x10U)                            /*!< ADC channel 16 */
#define ADC_CHANNEL_17                   ((uint8_t)0x11U)                            /*!< ADC channel 17 */
#define ADC_CHANNEL_18                   ((uint8_t)0x12U)                            /*!< ADC channel 18 */

/* @STRUCT_MEMBER: sampling_time */
/* @DEFINE: ADC sample time */
#define ADC_SAMPLETIME_1POINT5           SAMPTX_SPT(0)                               /*!< 1.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5           SAMPTX_SPT(1)                               /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_13POINT5          SAMPTX_SPT(2)                               /*!< 13.5 sampling cycles */
#define ADC_SAMPLETIME_28POINT5          SAMPTX_SPT(3)                               /*!< 28.5 sampling cycles */
#define ADC_SAMPLETIME_41POINT5          SAMPTX_SPT(4)                               /*!< 41.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5          SAMPTX_SPT(5)                               /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_71POINT5          SAMPTX_SPT(6)                               /*!< 71.5 sampling cycles */
#define ADC_SAMPLETIME_239POINT5         SAMPTX_SPT(7)                               /*!< 239.5 sampling cycles */

/* @FUNCTION: configure ADC routine rank */
int32_t hal_adc_routine_rank_config(hal_adc_dev_struct *adc_dev, hal_adc_routine_rank_config_struct *p_rrank);

/* @PARA: p_rchannel */
/* @STRUCT: routine sequence settings config struct */
typedef struct {
    ControlStatus              routine_sequence_conversions;                         /*!< routine sequence enable */
    uint32_t                   routine_sequence_length;                              /*!< routine sequence length */
    uint32_t                   routine_sequence_external_trigger_select;             /*!< external trigger select for routine sequence */
    ControlStatus              continuous_mode;                                      /*!< continuous mode */
    ControlStatus              discontinuous_mode;                                   /*!< discontinuous mode */
    uint32_t                   number_of_conversions_in_discontinuous_mode;          /*!< discontinuous mode length */
} hal_adc_routine_config_struct;

/* @STRUCT_MEMBER: routine_sequence_conversions */
/* @SP: ENABLE/DISABLE */

