PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_adc.h
/* @STRUCT_MEMBER: routine_sequence_length */
/* @=NULL */

/* @STRUCT_MEMBER: routine_sequence_external_trigger_select */
/* @DEFINE: external trigger select for routine sequence */
#define ADC_EXTTRIG_ROUTINE_T0_CH0       CTL1_ETSRC(0)                              /*!< TIMER0 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH1       CTL1_ETSRC(1)                              /*!< TIMER0 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH2       CTL1_ETSRC(2)                              /*!< TIMER0 CH2 event select */
#define ADC_EXTTRIG_ROUTINE_T1_CH1       CTL1_ETSRC(3)                              /*!< TIMER1 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T2_TRGO      CTL1_ETSRC(4)                              /*!< TIMER2 TRGO event select */
#define ADC_EXTTRIG_ROUTINE_T14_CH0      CTL1_ETSRC(5)                              /*!< TIMER14 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_EXTI_11      CTL1_ETSRC(6)                              /*!< external interrupt line 11 */
#define ADC_EXTTRIG_ROUTINE_NONE         CTL1_ETSRC(7)                              /*!< software trigger */

/* @STRUCT_MEMBER: continuous_mode */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: discontinuous_mode */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: number_of_conversions_in_discontinuous_mode */
/* @=NULL */

/* @FUNCTION: configure adc routine channel */
int32_t hal_adc_routine_channel_config(hal_adc_dev_struct *adc_dev, hal_adc_routine_config_struct *p_rchannel);

/* @PARA: p_irank */
/* ADC inserted channel configuration structure */
/* @STRUCT: inserted rank settings config struct */
typedef struct {
    uint32_t                            channel;                                   /*!< ADC channel select */
    uint32_t                            sampling_time;                             /*!< ADC sample time */
    uint32_t                            data_offset;                               /*!< ADC data offset */
    hal_adc_inserted_sequence_enum      inserted_sequence;                         /*!< ADC inserted channel sequence */
} hal_adc_inserted_rank_config_struct;

/* @STRUCT_MEMBER: channel */
/* @REFER: ADC_CHANNEL_0 */

/* @STRUCT_MEMBER: sampling_time */
/* @DEFINE: ADC sample time */
#define ADC_SAMPLETIME_1POINT5           SAMPTX_SPT(0)                             /*!< 1.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5           SAMPTX_SPT(1)                             /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_13POINT5          SAMPTX_SPT(2)                             /*!< 13.5 sampling cycles */
#define ADC_SAMPLETIME_28POINT5          SAMPTX_SPT(3)                             /*!< 28.5 sampling cycles */
#define ADC_SAMPLETIME_41POINT5          SAMPTX_SPT(4)                             /*!< 41.5 sampling cycles */
#define ADC_SAMPLETIME_55POINT5          SAMPTX_SPT(5)                             /*!< 55.5 sampling cycles */
#define ADC_SAMPLETIME_71POINT5          SAMPTX_SPT(6)                             /*!< 71.5 sampling cycles */
#define ADC_SAMPLETIME_239POINT5         SAMPTX_SPT(7)                             /*!< 239.5 sampling cycles */

/* @STRUCT_MEMBER: data_offset */
/* @=NULL */

/* @FUNCTION: configure ADC inserted rank */
int32_t hal_adc_inserted_rank_config(hal_adc_dev_struct *adc_dev, hal_adc_inserted_rank_config_struct *p_irank);

/* @PARA: p_ichannel */
/* ADC inserted channel initialization structure */
/* @STRUCT: inserted sequence settings config struct */
typedef struct {
    ControlStatus           inserted_sequence_conversions;                         /*!< inserted sequence enable */
    uint32_t                inserted_sequence_length;                              /*!< ADC inserted channel sequence,0~3 */
    uint32_t                inserted_sequence_external_trigger_select;             /*!< ADC inserted channel sequence external trigger select */
    ControlStatus           auto_convert;                                          /*!< ADC inserted channel convert automatically */
    ControlStatus           discontinuous_mode;                                    /*!< ADC inserted channel discontinuous mode */
} hal_adc_inserted_config_struct;

/* @STRUCT_MEMBER: inserted_sequence_conversions */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: inserted_sequence_length */
/* @=NULL */

/* @STRUCT_MEMBER: inserted_sequence_external_trigger_select */
/* @DEFINE: external trigger select for inserted sequence */
#define ADC_EXTTRIG_INSERTED_T0_TRGO        CTL1_ETSIC(0)                          /*!< TIMER0 TRGO event select */
#define ADC_EXTTRIG_INSERTED_T0_CH3         CTL1_ETSIC(1)                          /*!< TIMER0 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T1_TRGO        CTL1_ETSIC(2)                          /*!< TIMER1 TRGO event select */
#define ADC_EXTTRIG_INSERTED_T1_CH0         CTL1_ETSIC(3)                          /*!< TIMER1 CH0 event select */
#define ADC_EXTTRIG_INSERTED_T2_CH3         CTL1_ETSIC(4)                          /*!< TIMER2 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T14_TRGO       CTL1_ETSIC(5)                          /*!< TIMER14 TRGO event select */
#define ADC_EXTTRIG_INSERTED_EXTI_15        CTL1_ETSIC(6)                          /*!< external interrupt line 15 */
#define ADC_EXTTRIG_INSERTED_NONE           CTL1_ETSIC(7)                          /*!< software trigger */

/* @STRUCT_MEMBER: auto_convert */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: discontinuous_mode */
/* @SP: ENABLE/DISABLE */

/* @FUNCTION: configure ADC inserted channel */
int32_t hal_adc_inserted_channel_config(hal_adc_dev_struct *adc_dev, hal_adc_inserted_config_struct *p_ichannel);

/* Analog Watchdog Settings */
/* @PARA: p_watchdog */
/* @STRUCT: analog watchdog settings config struct */
typedef struct {
    ControlStatus               routine_sequence_analog_watchdog;                  /*!< routine sequence analog watchdog enable */
    ControlStatus               inserted_sequence_analog_watchdog;                 /*!< inserted sequence analog watchdog enable */
    uint32_t                    analog_watchdog_mode;                              /*!< analog watchdog mode */
    uint32_t                    analog_watchdog_channel_select;                    /*!< analog watchdog channel select */
    uint16_t                    analog_watchdog_high_threshold;                    /*!< ADC analog watchdog high threshold */
    uint16_t                    analog_watchdog_low_threshold;                     /*!< ADC analog watchdog low threshold */
} hal_adc_watchdog_config_struct;

/* @STRUCT_MEMBER: routine_sequence_analog_watchdog */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: inserted_sequence_analog_watchdog */
/* @SP: ENABLE/DISABLE */

/* @STRUCT_MEMBER: analog_watchdog_mode */
/* @DEFINE: analog watchdog mode */
#define ADC_WATCHDOG_MODE_ALL_CHANNELS                    0                       /*!< Analog watchdog is effective on all channels */
#define ADC_WATCHDOG_MODE_SINGLE_CHANNEL                  1                       /*!< Analog watchdog is effective on a single channel */

/* @STRUCT_MEMBER: analog_watchdog_channel_select */
/* @DEFINE: ADC analog watchdog channel select */
#define ADC_CHANNEL_0                    ((uint8_t)0x00U)                            /*!< ADC channel 0 */
#define ADC_CHANNEL_1                    ((uint8_t)0x01U)                            /*!< ADC channel 1 */
#define ADC_CHANNEL_2                    ((uint8_t)0x02U)                            /*!< ADC channel 2 */
#define ADC_CHANNEL_3                    ((uint8_t)0x03U)                            /*!< ADC channel 3 */
#define ADC_CHANNEL_4                    ((uint8_t)0x04U)                            /*!< ADC channel 4 */
#define ADC_CHANNEL_5                    ((uint8_t)0x05U)                            /*!< ADC channel 5 */
#define ADC_CHANNEL_6                    ((uint8_t)0x06U)                            /*!< ADC channel 6 */
#define ADC_CHANNEL_7                    ((uint8_t)0x07U)                            /*!< ADC channel 7 */
#define ADC_CHANNEL_8                    ((uint8_t)0x08U)                            /*!< ADC channel 8 */
#define ADC_CHANNEL_9                    ((uint8_t)0x09U)                            /*!< ADC channel 9 */
#define ADC_CHANNEL_10                   ((uint8_t)0x0AU)                            /*!< ADC channel 10 */
#define ADC_CHANNEL_11                   ((uint8_t)0x0BU)                            /*!< ADC channel 11 */
#define ADC_CHANNEL_12                   ((uint8_t)0x0CU)                            /*!< ADC channel 12 */
#define ADC_CHANNEL_13                   ((uint8_t)0x0DU)                            /*!< ADC channel 13 */
#define ADC_CHANNEL_14                   ((uint8_t)0x0EU)                            /*!< ADC channel 14 */
#define ADC_CHANNEL_15                   ((uint8_t)0x0FU)                            /*!< ADC channel 15 */
#define ADC_CHANNEL_16                   ((uint8_t)0x10U)                            /*!< ADC channel 16 */
#define ADC_CHANNEL_17                   ((uint8_t)0x11U)                            /*!< ADC channel 17 */
#define ADC_CHANNEL_18                   ((uint8_t)0x12U)                            /*!< ADC channel 18 */

/* @STRUCT_MEMBER: analog_watchdog_high_threshold */
/* @=NULL */

/* @STRUCT_MEMBER: analog_watchdog_low_threshold */
/* @=NULL */

/* @FUNCTION: configure watchdog */
int32_t hal_adc_watchdog_config(hal_adc_dev_struct *adc_dev, hal_adc_watchdog_config_struct *p_watchdog);
/* @END */


