PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_adc.h
/* ADC internal channel */
#define ADC_CHANNEL_TEMPSENSOR                  ADC_CHANNEL_16                    /*!< ADC temperature sensor channel */
#define ADC_CHANNEL_VREFINT                     ADC_CHANNEL_17                    /*!< ADC VREFINT channel */
#define ADC_CHANNEL_BATTERY                     ADC_CHANNEL_18                    /*!< ADC backup battery voltage channel */

/* get ADC init value */
#define __HAL_ADC_GET_SCAN_MODE                 (uint32_t)((ADC_CTL0) & (ADC_CTL0_SM))               /*!< get ADC scan mode init value */
#define __HAL_ADC_GET_CONTINUOUS_MODE           (uint32_t)((ADC_CTL1) & (ADC_CTL1_CTN))              /*!< get ADC continuous mode init value */
#define __HAL_ADC_GET_TEMPVREF_ENABLE           (uint32_t)((ADC_CTL1) & (ADC_CTL1_TSVREN))           /*!< get ADC internal channel enable init value */
#define __HAL_ADC_GET_BATTERY_ENABLE            (uint32_t)((ADC_CTL1) & (ADC_CTL1_VBETEN))           /*!< get ADC internal channel enable init value */
#define __HAL_ADC_GET_OVERSAMPLE_ENABLE         (uint32_t)((ADC_OVSAMPCTL) & (ADC_OVSAMPCTL_OVSEN))  /*!< get ADC oversampling enable init value */
#define __HAL_ADC_GET_DMA_MODE                  (uint32_t)((ADC_CTL1) & (ADC_CTL1_DMA))              /*!< get ADC DMA mode init value */

#define __HAL_ADC_GET_ROUTINECH_LENGTH          (uint32_t)((ADC_RSQ0) & (ADC_RSQ0_RL))               /*!< get ADC routine sequence length value */
#define __HAL_ADC_GET_ROUTINECH_EXTTRIGGER      (uint32_t)((ADC_CTL1) & (ADC_CTL1_ETSRC))            /*!< get ADC routine external trigger select */

#define __HAL_ADC_GET_INSERTEDCH_LENGTH         (uint32_t)((ADC_RSQ0) & (ADC_RSQ0_RL))               /*!< get ADC inserted sequence length value */
#define __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER     (uint32_t)((ADC_CTL1) & (ADC_CTL1_ETSIC))            /*!< get ADC inserted external trigger select */
#define __HAL_ADC_GET_INSERTEDCH_AUTOCONV       (uint32_t)((ADC_CTL0) & (ADC_CTL0_ICA))              /*!< get ADC inserted sequence automatic conversion */

/* function declarations */
/* initialize the ADC structure with the default values */
void hal_adc_struct_init(hal_adc_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize ADC */
int32_t hal_adc_deinit(hal_adc_dev_struct *adc_dev);
/* ADC calibration */
int32_t hal_adc_calibration_start(hal_adc_dev_struct *adc_dev);

/* ADC routine channel */
/* enable ADC and start the conversion of routine sequence */
int32_t hal_adc_start(hal_adc_dev_struct *adc_dev);
/* stop the conversion of routine sequence and disable ADC */
int32_t hal_adc_stop(hal_adc_dev_struct *adc_dev);
/* polling for ADC routine sequence conversion */
int32_t hal_adc_routine_conversion_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms);
/* enable ADC routine sequence software trigger */
void hal_adc_routine_software_trigger_enable(hal_adc_dev_struct *adc_dev);
/* start ADC EOC interrupt */
int32_t hal_adc_start_interrupt(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq);
/* stop ADC EOC interrupt */
int32_t hal_adc_stop_interrupt(hal_adc_dev_struct *adc_dev);

/* ADC DMA */
/* enable ADC and start the conversion of routine sequence with DMA */
int32_t hal_adc_start_dma(hal_adc_dev_struct *adc_dev, uint32_t *pdata, uint32_t length, hal_adc_dma_handle_cb_struct *dmacb);
/* stop the conversion of routine sequence, disable ADC DMA mode and disable ADC */
int32_t hal_adc_stop_dma(hal_adc_dev_struct *adc_dev);

/* ADC inserted channel */
/* enable ADC and start the conversion of inserted sequence */
int32_t hal_adc_inserted_start(hal_adc_dev_struct *adc_dev);
/* stop the conversion of inserted sequence and disable ADC */
int32_t hal_adc_inserted_stop(hal_adc_dev_struct *adc_dev);
/* polling for ADC inserted sequence conversion */
int32_t hal_adc_inserted_conversion_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms);
/* enable ADC inserted sequence software trigger */
void hal_adc_inserted_software_trigger_enable(hal_adc_dev_struct *adc_dev);
/* start ADC EOIC interrupt */
int32_t hal_adc_inserted_start_interrupt(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq);
/* stop ADC EOIC interrupt */
int32_t hal_adc_inserted_stop_interrupt(hal_adc_dev_struct *adc_dev);

/* ADC watchdog */
/* enable ADC watchdog interrupt */
int32_t hal_adc_watchdog_interrupt_enable(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq);
/* disable ADC watchdog interrupt */
int32_t hal_adc_watchdog_interrupt_disable(hal_adc_dev_struct *adc_dev);
/* polling for ADC watchdog event conversion */
int32_t hal_adc_watchdog_event_poll(hal_adc_dev_struct *adc_dev, uint32_t timeout_ms);

/* interrupt handle */
/* ADC interrupt handler content function, which is merely used in ADC_CMP_IRQHandler */
void hal_adc_irq(hal_adc_dev_struct *adc_dev);
/* set user-defined interrupt callback function,
which will be registered and called when corresponding interrupt be triggered */
void hal_adc_irq_handle_set(hal_adc_dev_struct *adc_dev, hal_adc_irq_struct *p_irq);
/* reset all user-defined interrupt callback function,
which will be registered and called when corresponding interrupt be triggered */
void hal_adc_irq_handle_all_reset(hal_adc_dev_struct *adc_dev);

/* get ADC value and state */
/* get routine sequence conversion result */
uint16_t hal_adc_routine_value_get(hal_adc_dev_struct *adc_dev);
/* get inserted sequence conversion result */
uint16_t hal_adc_inserted_value_get(hal_adc_dev_struct *adc_dev, uint8_t inschannel_sequence);
/* get ADC error */
uint32_t hal_adc_error_get(hal_adc_dev_struct *adc_dev);
/* get ADC state */
uint32_t hal_adc_state_get(hal_adc_dev_struct *adc_dev);

/* function declarations */
/* reset ADC */
void hals_adc_deinit(void);
/* enable ADC interface */
void hals_adc_enable(void);
/* disable ADC interface */
void hals_adc_disable(void);

/* ADC calibration and reset calibration */
void hals_adc_calibration_enable(void);
/* enable DMA request */
void hals_adc_dma_mode_enable(void);
/* disable DMA request */
void hals_adc_dma_mode_disable(void);

/* enable or disable ADC special function */
void hals_adc_special_function_config(uint32_t function, ControlStatus newvalue);

/* configure ADC data alignment */
void hals_adc_data_alignment_config(uint32_t data_alignment);
/* configure the length of routine channel sequence or inserted channel sequence */
void hals_adc_channel_length_config(uint8_t channel_sequence, uint32_t length);
/* configure ADC routine channel */
void hals_adc_routine_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time);
/* configure ADC inserted channel */
void hals_adc_inserted_channel_config(uint8_t rank, uint8_t channel, uint32_t sample_time);
/* configure ADC inserted channel offset */
void hals_adc_inserted_channel_offset_config(uint8_t inserted_channel, uint16_t offset);
/* enable ADC external trigger */
void hals_adc_external_trigger_config(uint8_t channel_sequence, ControlStatus newvalue);
/* configure ADC external trigger source */
void hals_adc_external_trigger_source_config(uint8_t channel_sequence, uint32_t external_trigger_source);
/* enable ADC software trigger */
void hals_adc_software_trigger_enable(uint8_t channel_sequence);

/* read ADC inserted sequence data register */
uint16_t hals_adc_inserted_data_read(uint8_t inserted_channel);

/* configure ADC resolution */
void hals_adc_resolution_config(uint32_t resolution);
/* configure ADC oversample mode */
void hals_adc_oversample_mode_config(uint8_t mode, uint16_t shift, uint8_t ratio);
/* enable ADC oversample mode */
void hals_adc_oversample_mode_enable(void);
/* disable ADC oversample mode */
void hals_adc_oversample_mode_disable(void);

/* get the ADC flag bits */
FlagStatus hals_adc_flag_get(uint32_t flag);
/* clear the ADC flag bits */
void hals_adc_flag_clear(uint32_t flag);
/* enable ADC interrupt */
void hals_adc_interrupt_enable(uint32_t interrupt);
/* disable ADC interrupt */
void hals_adc_interrupt_disable(uint32_t interrupt);
/* get the ADC interrupt bits */
FlagStatus hals_adc_interrupt_flag_get(uint32_t flag);
/* clear the ADC interrupt flag */
void hals_adc_interrupt_flag_clear(uint32_t flag);

#endif /* GD32F3X0_HAL_ADC_H */
